-- phpMyAdmin SQL Dump
-- version 4.7.9
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 11 2018 г., 17:52
-- Версия сервера: 10.1.31-MariaDB
-- Версия PHP: 7.2.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `slava102938`
--

-- --------------------------------------------------------

--
-- Структура таблицы `countries`
--

CREATE TABLE `countries` (
  `id` int(11) NOT NULL,
  `countrie` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `countries`
--

INSERT INTO `countries` (`id`, `countrie`) VALUES
(2, 'остров Вознесения'),
(3, 'Андорра'),
(4, 'Объединенные Арабские Эмираты'),
(5, 'Афганистан'),
(6, 'Антигуа и Барбуда'),
(7, 'Албания'),
(8, 'Армения'),
(9, 'Голланские Антильские острова'),
(10, 'Ангола'),
(11, 'Антарктика'),
(12, 'Аргентина'),
(13, 'Американское Самоа'),
(14, 'Австрия'),
(15, 'Австралия'),
(16, 'Аруба'),
(17, 'Аландские острова'),
(18, 'Азербайджан'),
(19, 'Босния и Герцеговина'),
(20, 'Барбадос'),
(21, 'Бангладеш'),
(22, 'Бельгия'),
(23, 'Буркина-Фасо'),
(24, 'Болгария'),
(25, 'Бахрейн'),
(26, 'Бурунди'),
(27, 'Бенин'),
(28, 'Бермудские острова'),
(29, 'Бруней'),
(30, 'Боливия'),
(31, 'Бразилия'),
(32, 'Багамские острова'),
(33, 'Бутан'),
(34, 'Ботсвана'),
(35, 'Беларусь'),
(36, 'Белиз'),
(37, 'Канада'),
(38, 'Кокосовые острова'),
(39, 'Конго'),
(40, 'Центральноафриканская Республика'),
(41, 'Конго'),
(42, 'Швейцария'),
(43, 'Кот-дИвуар'),
(44, 'острова Кука'),
(45, 'Чили'),
(46, 'Камерун'),
(47, 'Китай'),
(48, 'Колумбия'),
(49, 'Коста-Рика'),
(50, 'Сербия и Черногория'),
(51, 'Куба'),
(52, 'Кабо-Верде'),
(53, 'остров Рождества'),
(54, 'Кипр'),
(55, 'Чехия'),
(56, 'Германия'),
(57, 'Джибути'),
(58, 'Дания'),
(59, 'Доминика'),
(60, 'Доминиканская Республика'),
(61, 'Алжир'),
(62, 'Эквадор'),
(63, 'Эстония'),
(64, 'Египет'),
(65, 'Западная Сахара'),
(66, 'Эритрея'),
(67, 'Испания'),
(68, 'Эфиопия'),
(69, 'Финляндия'),
(70, 'Фиджи'),
(71, 'Фолклендские острова'),
(72, 'Микронезия'),
(73, 'Фарерские острова'),
(74, 'Франция'),
(75, 'Габон'),
(76, 'Соединенное Королевство Великобритании и Северной Ирландии'),
(77, 'Гренада'),
(78, 'Грузия'),
(79, 'Французская Гвиана'),
(80, 'остров Гернси'),
(81, 'Гана'),
(82, 'Гибралтар'),
(83, 'Гренландия'),
(84, 'Гамбия'),
(85, 'Гвинея'),
(86, 'Гваделупа'),
(87, 'Экваториальная Гвинея'),
(88, 'Греция'),
(89, 'Южная Джорджия и Южные Сандвичевы острова'),
(90, 'Гватемала'),
(91, 'Гуам'),
(92, 'Гвинея-Бисау'),
(93, 'Гайана'),
(94, 'Гонконг'),
(95, 'Гондурас'),
(96, 'Хорватия'),
(97, 'Гаити'),
(98, 'Венгрия'),
(99, 'Индонезия'),
(100, 'Ирландия'),
(101, 'Израиль'),
(102, 'остров Мэн'),
(103, 'Индия'),
(104, 'Ирак'),
(105, 'Иран'),
(106, 'Исландия'),
(107, 'Италия'),
(108, 'остров Джерси'),
(109, 'Ямайка'),
(110, 'Иордания'),
(111, 'Япония'),
(112, 'Кения'),
(113, 'Кыргызстан'),
(114, 'Камбоджа'),
(115, 'Кирибати'),
(116, 'Коморские острова'),
(117, 'Сент-Китс и Невис'),
(118, 'Северная Корея'),
(119, 'Южная Корея'),
(120, 'Кувейт'),
(121, 'Каймановы острова'),
(122, 'Казахстан'),
(123, 'Лаос'),
(124, 'Ливан'),
(125, 'Сент-Люсия'),
(126, 'Лихтенштейн'),
(127, 'Шри-Ланка'),
(128, 'Либерия'),
(129, 'Лесото'),
(130, 'Литва'),
(131, 'Люксембург'),
(132, 'Латвия'),
(133, 'Ливия'),
(134, 'Марокко'),
(135, 'Монако'),
(136, 'Монтенегро'),
(137, 'Молдова'),
(138, 'Мадагаскар'),
(139, 'Маршалловы острова'),
(140, 'Македония'),
(141, 'Мали'),
(142, 'Мьянма'),
(143, 'Монголия'),
(144, 'Макао'),
(145, 'Mariana  Северные Марианские острова'),
(146, 'Мартиника'),
(147, 'Мавритания'),
(148, 'Монтсеррат'),
(149, 'Мальта'),
(150, 'Маврикий'),
(151, 'Мальдивы'),
(152, 'Малави'),
(153, 'Мексика'),
(154, 'Малайзия'),
(155, 'Мозамбик'),
(156, 'Намибия'),
(157, 'Новая Каледония'),
(158, 'Нигер'),
(159, 'Норфолк'),
(160, 'Нигерия'),
(161, 'Никарагуа'),
(162, 'Нидерланды'),
(163, 'Норвегия'),
(164, 'Непал'),
(165, 'Науру'),
(166, 'Новая Зеландия'),
(167, 'Оман'),
(168, 'Панама'),
(169, 'Перу'),
(170, 'Французская Полинезия'),
(171, 'Папуа - Новая Гвинея'),
(172, 'Филиппины'),
(173, 'Пакистан'),
(174, 'Польша'),
(175, 'Сен-Пьер и Микелон'),
(176, 'остров Питкэрн'),
(177, 'Пуэрто-Рико'),
(178, 'Палестина'),
(179, 'Португалия'),
(180, 'Палау'),
(181, 'Парагвай'),
(182, 'Катар'),
(183, 'остров Реюньон'),
(184, 'Румыния'),
(185, 'Россия'),
(186, 'Руанда'),
(187, 'Саудовская Аравия'),
(188, 'Соломоновы Острова'),
(189, 'Сейшельские Острова'),
(190, 'Судан'),
(191, 'Швеция'),
(192, 'Сингапур'),
(193, 'остров Святой Елены'),
(194, 'Словения'),
(195, 'Словакия'),
(196, 'Сьерра-Леоне'),
(197, 'Сан-Марино'),
(198, 'Сенегал'),
(199, 'Сомали'),
(200, 'Суринам'),
(201, 'Сан-Томе и Принсипи'),
(202, 'СССР'),
(203, 'Сальвадор'),
(204, 'Сирия'),
(205, 'Свазиленд'),
(206, 'Чад'),
(207, 'Того'),
(208, 'Таиланд'),
(209, 'Таджикистан'),
(210, 'Токелау'),
(211, 'Туркменистан'),
(212, 'Тунис'),
(213, 'Тонга'),
(214, 'Восточный Тимор'),
(215, 'Турция'),
(216, 'Тринидад и Тобаго'),
(217, 'Тувалу'),
(218, 'Тайвань'),
(219, 'Танзания'),
(220, 'Украина'),
(221, 'Уганда'),
(222, 'Соединенное Королевство Великобритании и Северной Ирландии'),
(223, 'США'),
(224, 'Уругвай'),
(225, 'Узбекистан'),
(226, 'Ватикан'),
(227, 'Сент-Винсент и Гренадины'),
(228, 'Венесуэла'),
(229, 'Виргинские острова, Британские'),
(230, 'Виргинские острова, США'),
(231, 'Вьетнам'),
(232, 'Вануату'),
(233, 'Западное Самоа'),
(234, 'Йемен'),
(235, 'Югославия'),
(236, 'ЮАР'),
(237, 'Замбия'),
(238, 'Зимбабве');

-- --------------------------------------------------------

--
-- Структура таблицы `langs`
--

CREATE TABLE `langs` (
  `id` int(11) NOT NULL,
  `lang` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `langs`
--

INSERT INTO `langs` (`id`, `lang`) VALUES
(1, 'аварский'),
(2, 'адыгейский'),
(3, 'азербайджанский'),
(4, 'аккадский'),
(5, 'албанский'),
(6, 'алеутский'),
(7, 'алюторский'),
(8, 'английский'),
(9, 'арабский'),
(10, 'арамейский'),
(11, 'армянский'),
(12, 'африкаанс'),
(13, 'ацтекский'),
(14, 'баскский'),
(15, 'башкирский'),
(16, 'белорусский'),
(17, 'болгарский'),
(18, 'бурский'),
(19, 'бурят-монгольский'),
(20, 'бухарскоеврейский'),
(21, 'венгерский'),
(22, 'венетский'),
(23, 'вепсский'),
(24, 'водский'),
(25, 'вотяцкий (вотский)'),
(26, 'вьетнамский'),
(27, 'гиляцкий'),
(28, 'голландский'),
(29, 'граубюнденский'),
(30, 'грузинский'),
(31, 'датский'),
(32, 'доломитский'),
(33, 'древнееврейский (иврит)'),
(34, 'еврейский (идиш)'),
(35, 'енисейско-остяцкий'),
(36, 'игбо'),
(37, 'ижорский'),
(38, 'иллирийский'),
(39, 'ингушский'),
(40, 'индонезийский'),
(41, 'ирландский'),
(42, 'исландский'),
(43, 'испанский'),
(44, 'итальянский'),
(45, 'ительменский'),
(46, 'кабардино-черкесский'),
(47, 'казахский'),
(48, 'калмыцкий'),
(49, 'камчадальский'),
(50, 'карачаево-балкарский'),
(51, 'карельский'),
(52, 'кашубский (диалект польского)'),
(53, 'керекский'),
(54, 'кетский'),
(55, 'кечуа'),
(56, 'киргизский'),
(57, 'китайский'),
(58, 'коми(-зырянский)'),
(59, 'коми-пермяцкий'),
(60, 'корейский'),
(61, 'корякский'),
(62, 'крымскотатарский'),
(63, 'кумыкский'),
(64, 'курвальский'),
(65, 'ладинский'),
(66, 'лакский'),
(67, 'латинский'),
(68, 'латышский'),
(69, 'лезгинский'),
(70, 'ливский'),
(71, 'литовский'),
(72, 'луораветланский'),
(73, 'македонский'),
(74, 'малайский'),
(75, 'марийские'),
(76, 'мегрельский (мингрельский)'),
(77, 'мессапский'),
(78, 'мокшанский (мокша-мордовский)'),
(79, 'молдавский (диалект румынского)'),
(80, 'монгольский'),
(81, 'мордовские'),
(82, 'нганасанский'),
(83, 'немецкий'),
(84, 'ненецкий'),
(85, 'нивхский'),
(86, 'нидерландский'),
(87, 'нымыланский'),
(88, 'оджибва (оджибве)'),
(89, 'ойратский'),
(90, 'олюторский'),
(91, 'осетинский'),
(92, 'персидский'),
(93, 'польский'),
(94, 'португальский'),
(95, 'прусский'),
(96, 'ретороманские'),
(97, 'романшский (руманшский)'),
(98, 'румынский'),
(99, 'русский'),
(100, 'cелькупский'),
(101, 'сербский'),
(102, 'словацкий'),
(103, 'словенский'),
(104, 'словио'),
(105, 'сымский'),
(106, 'татарский'),
(107, 'тирольский (триентский)'),
(108, 'тсалаги'),
(109, 'турецкий'),
(110, 'угаритский'),
(111, 'удмуртский'),
(112, 'украинский'),
(113, 'унанганский'),
(114, 'фарлинго'),
(115, 'фарси'),
(116, 'финский'),
(117, 'фламандский'),
(118, 'французский'),
(119, 'фриульский (фурланский)'),
(120, 'хакасский'),
(121, 'халха-монгольский'),
(122, 'хорватский'),
(123, 'чероки'),
(124, 'чеченский'),
(125, 'чешский'),
(126, 'чжурчжэньский'),
(127, 'чукотский'),
(128, 'чувашский'),
(129, 'шведский'),
(130, 'швейцарско-ретороманский'),
(131, 'шумерский'),
(132, 'эдо'),
(133, 'энецкий'),
(134, 'эрзянский(эрзя-мордовский)'),
(135, 'эскимосский'),
(136, 'эсперанто'),
(137, 'эстонский'),
(138, 'югский'),
(139, 'юкагирский'),
(140, 'якутский'),
(141, 'японский');

-- --------------------------------------------------------

--
-- Структура таблицы `message`
--

CREATE TABLE `message` (
  `id` int(11) NOT NULL,
  `id_recipient` int(11) NOT NULL COMMENT 'id_получателя',
  `id_sender` int(11) NOT NULL COMMENT 'id_отправителя',
  `login_recipient` varchar(256) NOT NULL COMMENT 'логин_получателя',
  `login_sender` varchar(256) NOT NULL COMMENT 'логин_отправителя',
  `topic` varchar(256) NOT NULL,
  `messtext` text NOT NULL,
  `messtime` varchar(256) NOT NULL,
  `viewed` int(11) NOT NULL COMMENT 'просмотрено'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `status` int(11) NOT NULL,
  `baned` int(11) NOT NULL,
  `login` varchar(256) NOT NULL,
  `password` varchar(256) NOT NULL,
  `salt` varchar(256) NOT NULL,
  `cookie` varchar(256) NOT NULL,
  `name` varchar(256) NOT NULL,
  `lastname` varchar(256) NOT NULL,
  `email` varchar(256) NOT NULL,
  `date` varchar(256) NOT NULL,
  `registr` varchar(256) NOT NULL,
  `countrieId` varchar(256) NOT NULL,
  `langId` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `status`, `baned`, `login`, `password`, `salt`, `cookie`, `name`, `lastname`, `email`, `date`, `registr`, `countrieId`, `langId`) VALUES
(1, 10, 0, 'slava102938', '1a10e6d645bef0ca14d8d7799f6dc7be', 'ChsI27', '', 'Вьячеслав', 'Михащенко', 'slava102938@inbox.lv', '', '21.10.2017', '132', '68'),
(6, 1, 0, 'tigr12345', 'a8224ee11e200a772c3cabf8c15e245f', 'OOYD8Fg', '', 'Тигр', 'Кошачий', 'tigr12345@gmail.com', '', '25.10.2017', '220', '99');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `langs`
--
ALTER TABLE `langs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `countries`
--
ALTER TABLE `countries`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=239;

--
-- AUTO_INCREMENT для таблицы `langs`
--
ALTER TABLE `langs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=142;

--
-- AUTO_INCREMENT для таблицы `message`
--
ALTER TABLE `message`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
